---
{"version":"0.70.0\n","title":"random decimal","categories":"random","usage":"Generate a random decimal within a range [min..max]\n"}
---
<!-- THIS FILE IS GENERATED BY update_book_commands.cjs USING NUSHELL'S HELP COMMANDS.
REFRAIN FROM EDITING IT MANUALLY.-->
# <code>random decimal</code> for random

<div class='command-title'>Generate a random decimal within a range [min..max]</div>

## Signature

```> random decimal (range)```

## Flags

 * ```-h, --help```: Display this help message
## Parameters

 * ```(optional) range <Range>```: Range of values
## Examples

  Generate a default decimal value between 0 and 1
```shell
  > random decimal
```
  Generate a random decimal less than or equal to 500
```shell
  > random decimal ..500
```
  Generate a random decimal greater than or equal to 100000
```shell
  > random decimal 100000..
```
  Generate a random decimal between 1.0 and 1.1
```shell
  > random decimal 1.0..1.1
```


